app/Controllers/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $data['items'] = $this->products->findAll();